<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"72f3be4a5ec4c9e10245bd09a5f0404d1c85cd22c8d5331687129ef92e2fee8a","plan_job_ref":"Job Environment Main - Plan #1508 at https://github.com/jarrod-lowe/wildsea/actions/runs/16718940698","plan_out_hash":"35691e8e998e9d6f13616e511454a90be0c7b7799332f29ddd2d7324418b2497","plan_hash":"98441796fe2e64a0bb76ec7c3a86c9ac9b6bc1ba0d17474bd1c1c68f334f46bf","plan_text_format":"diff","version":"2.2.1"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                updateJoinCode(input: UpdateJoinCodeInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createNPC(input: CreateNPCInput!): PlayerSheetSummary! @aws_cognito_user_pools
                rollDice(input: RollDiceInput!): DiceRoll! @aws_cognito_user_pools
                updateUserSettings(input: UpdateUserSettingsInput!): UserSettings! @aws_cognito_user_pools
          +     setSystemNotification(input: SetSystemNotificationInput!): SystemNotification! @aws_iam
            }
            
            type GamesWithQuota @aws_cognito_user_pools {
              games: [PlayerSheetSummary!]!
              remainingGames: Int!
              totalQuota: Int!
            }
            
            type Query {
                getGame(input: GetGameInput!): Game! @aws_cognito_user_pools
                getGames: GamesWithQuota! @aws_cognito_user_pools
                getGameTypes(input: GetGameTypesInput!): [GameTypeMetadata!]! @aws_cognito_user_pools
                getCharacterTemplates(input: GetCharacterTemplatesInput!): [CharacterTemplateMetadata!]! @aws_cognito_user_pools
                getCharacterTemplate(input: GetCharacterTemplateInput!): [TemplateSectionData!]! @aws_cognito_user_pools
                getUserSettings: UserSettings @aws_cognito_user_pools
          +     getSystemNotification: SystemNotification @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createNPC", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame", "updateJoinCode"])
              diceRolled(gameId: ID!): DiceRoll @aws_subscribe(mutations: ["rollDice"])
              updatedUserSettings: UserSettings @aws_subscribe(mutations: ["updateUserSettings"])
          +   systemNotificationUpdated: SystemNotification @aws_subscribe(mutations: ["setSystemNotification"])
            }
            
            input GetGameInput {
              gameId: ID!
              language: String!
            }
            
            input GetGameTypesInput {
              language: String!
            }
            
            input GetCharacterTemplatesInput {
              gameType: String!
              language: String!
            }
            
            input GetCharacterTemplateInput {
              templateName: String!
              gameType: String!
              language: String!
            }
            
            input CreateGameInput {
                name: String!
                gameType: String!
                description: String
                language: String!
            }
            
            input JoinGameInput {
              joinCode: String!
              language: String!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input UpdateJoinCodeInput {
              gameId: ID!
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateNPCInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              remainingSections: Int!
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              gmUserId: ID!
              remainingSections: Int!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            union Dice = SingleDie
            
            input DiceInput {
              type: String!
              size: Int!
            }
            
            input RollDiceInput {
              gameId: ID!
              dice: [DiceInput!]!
              action: String
              rollType: String!
              target: Int!
              onBehalfOf: ID
            }
            
            type DiceRoll @aws_cognito_user_pools {
              gameId: ID!
              playerId: ID!
              playerName: String!
              dice: [Dice!]!
              rollType: String!
              target: Int!
              grade: String!
              action: String
              diceList: [Dice!]!
              value: Int!
              rolledAt: AWSDateTime!
              rolledBy: String!
              proxyRoll: Boolean!
              type: String!
              messageIndex: Int!
            }
            
            type SingleDie @aws_cognito_user_pools {
              type: String!
              size: Int!
              value: Int!
            }
            
            type GameTypeMetadata @aws_cognito_user_pools {
              gameType: String!
              displayName: String!
              language: String!
            }
            
            type CharacterTemplateMetadata @aws_cognito_user_pools {
              templateName: String!
              displayName: String!
              gameType: String!
              language: String!
            }
            
            type TemplateSectionData @aws_cognito_user_pools {
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
            }
            
            type UserSettings @aws_cognito_user_pools {
              userId: ID!
              settings: AWSJSON!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            input UpdateUserSettingsInput {
              settings: AWSJSON!
              language: String!
            }
          + 
          + input SetSystemNotificationInput {
          +   message: String
          +   urgent: Boolean
          + }
          + 
          + type SystemNotification @aws_cognito_user_pools @aws_iam {
          +   message: String
          +   urgent: Boolean!
          +   type: String!
          +   createdAt: AWSDateTime!
          +   updatedAt: AWSDateTime!
          + }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["getSystemNotification"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // query/getSystemNotification/getSystemNotification.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixNotification = "NOTIFICATION";
            
            // query/getSystemNotification/getSystemNotification.ts
            function request() {
              return {
                operation: "GetItem",
                key: {
                  PK: util.dynamodb.toString(`${DDBPrefixNotification}#SYSTEM`),
                  SK: util.dynamodb.toString(`${DDBPrefixNotification}#`)
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              if (!context.result) {
                return null;
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2V0U3lzdGVtTm90aWZpY2F0aW9uLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQXFCOzs7QUNVdkIsSUFBTSx3QkFBd0I7OztBREw5QixTQUFTLFVBQWtDO0FBQ2hELFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUs7QUFBQSxNQUNILElBQUksS0FBSyxTQUFTLFNBQVMsR0FBRyxxQkFBcUIsU0FBUztBQUFBLE1BQzVELElBQUksS0FBSyxTQUFTLFNBQVMsR0FBRyxxQkFBcUIsR0FBRztBQUFBLElBQ3hEO0FBQUEsRUFDRjtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTZDO0FBQ3BFLE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLE1BQUksQ0FBQyxRQUFRLFFBQVE7QUFDbkIsV0FBTztBQUFBLEVBQ1Q7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
+       data_source = "Wildsea_primary"
+       field       = "getSystemNotification"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Query"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["setSystemNotification"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // mutation/setSystemNotification/setSystemNotification.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixNotification = "NOTIFICATION";
            
            // lib/constants/entityTypes.ts
            var TypeNotification = "NOTIFICATION";
            
            // mutation/setSystemNotification/setSystemNotification.ts
            function request(context) {
              const { message, urgent = false } = context.arguments.input;
              const now = util.time.nowISO8601();
              const item = {
                message,
                urgent,
                type: TypeNotification,
                createdAt: now,
                updatedAt: now
              };
              return {
                operation: "PutItem",
                key: {
                  PK: util.dynamodb.toString(`${DDBPrefixNotification}#SYSTEM`),
                  SK: util.dynamodb.toString(`${DDBPrefixNotification}#`)
                },
                attributeValues: util.dynamodb.toMapValues(item)
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsic2V0U3lzdGVtTm90aWZpY2F0aW9uLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2VudGl0eVR5cGVzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBcUI7OztBQ1V2QixJQUFNLHdCQUF3Qjs7O0FDRjlCLElBQU0sbUJBQW1COzs7QUZDekIsU0FBUyxRQUNkLFNBQ3dCO0FBQ3hCLFFBQU0sRUFBRSxTQUFTLFNBQVMsTUFBTSxJQUFJLFFBQVEsVUFBVTtBQUV0RCxRQUFNLE1BQU0sS0FBSyxLQUFLLFdBQVc7QUFFakMsUUFBTSxPQUEyQjtBQUFBLElBQy9CO0FBQUEsSUFDQTtBQUFBLElBQ0EsTUFBTTtBQUFBLElBQ04sV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLEVBQ2I7QUFFQSxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxLQUFLO0FBQUEsTUFDSCxJQUFJLEtBQUssU0FBUyxTQUFTLEdBQUcscUJBQXFCLFNBQVM7QUFBQSxNQUM1RCxJQUFJLEtBQUssU0FBUyxTQUFTLEdBQUcscUJBQXFCLEdBQUc7QUFBQSxJQUN4RDtBQUFBLElBQ0EsaUJBQWlCLEtBQUssU0FBUyxZQUFZLElBQUk7QUFBQSxFQUNqRDtBQUNGO0FBRU8sU0FBUyxTQUNkLFNBQ29CO0FBQ3BCLE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source = "Wildsea_primary"
+       field       = "setSystemNotification"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Mutation"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["systemNotificationUpdated"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // subscription/systemNotificationUpdated/systemNotificationUpdated.ts
            import { util } from "@aws-appsync/utils";
            function request() {
              return { payload: {} };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return null;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsic3lzdGVtTm90aWZpY2F0aW9uVXBkYXRlZC50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQXFCO0FBRXZCLFNBQVMsVUFBVTtBQUV4QixTQUFPLEVBQUUsU0FBUyxDQUFDLEVBQUU7QUFDdkI7QUFFTyxTQUFTLFNBQVMsU0FBd0I7QUFDL0MsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBR0EsU0FBTztBQUNUOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source = "Wildsea_primary_local"
+       field       = "systemNotificationUpdated"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Subscription"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1508](https://github.com/jarrod-lowe/wildsea/actions/runs/16718940698)